## Combines 3 Different Player Name CSVs into One Master DF

Requirements - 3 CSV Files (in the same working directory):
1. player_names.csv
2. updated_player_names.csv
3. names_master

Output:
A master CSV files in the same directory

In [1]:
import pandas as pd
import numpy as np

In [2]:
path_names = '../../raw-data/player_names.csv'
path_u_names = '../../raw-data/updated_player_names.csv'
path_m_names = '../../raw-data/names_master.csv'

In [3]:
names = pd.read_csv(path_names)

u_names = pd.read_csv(path_u_names)
u_names.dropna(axis=0, how='all', subset=['id'], inplace=True)
u_names.drop(["player_name"], axis=1, inplace=True)
u_names['id'] = u_names['id'].astype('int64')

fields = ['mlb_id', 'mlb_name']
m_names = pd.read_csv(path_m_names, usecols=fields)
m_names.rename(columns={'mlb_id':'id'}, inplace=True)

In [4]:
m_names.head()

       id      mlb_name
0  592091   A.J. Achter
1  595918     A.J. Cole
2  454560    A.J. Ellis
3  456167  A.J. Griffin
4  543362  A.J. Jimenez

In [5]:
m_names[['first_name', 'last_name']] = m_names['mlb_name'].str.split(' ', 1, expand=True)
m_names.drop("mlb_name", axis=1, inplace=True)

In [6]:
#hopefully we get something with like 4000 rows that has every ID in AB p_id and b_id
print(names.shape)
print(u_names.shape)
print(m_names.shape)

(2218, 3)
(2517, 3)
(3307, 3)

In [7]:
m_names.head()

       id first_name last_name
0  592091       A.J.    Achter
1  595918       A.J.      Cole
2  454560       A.J.     Ellis
3  456167       A.J.   Griffin
4  543362       A.J.   Jimenez

In [8]:
u_names.head()

       id first_name last_name
0  430911      David   Aardsma
1  472551   Fernando      Abad
2  656061     Albert     Abreu
3  110029      Bobby     Abreu
4  650556      Bryan     Abreu

In [9]:
names.head()

       id first_name   last_name
0  452657        Jon      Lester
1  425794       Adam  Wainwright
2  457435       Phil        Coke
3  435400      Jason       Motte
4  519166       Neil     Ramirez

In [10]:
aid = 425794

filt1 = names['id'] == aid
filt2 = u_names['id'] == aid
filt3 = m_names['id'] == aid

In [11]:
names.loc[filt1]

       id first_name   last_name
1  425794       Adam  Wainwright

In [12]:
u_names.loc[filt2]

          id first_name   last_name
2382  425794       Adam  Wainwright

In [13]:
m_names.loc[filt3]

        id first_name   last_name
56  425794       Adam  Wainwright

In [14]:
#Dope they are all the same!
mu_names = m_names.merge(u_names, how='outer').drop_duplicates(subset=['id'])

In [15]:
mu_names.shape
# 500 new names!!! are the ids/names unique???

(3746, 3)

In [16]:
# there appear to be some duplicates... I want the shape and len unique to be the same
len(mu_names['id'].unique())

3746

In [17]:
all_names = mu_names.merge(names, how='outer').drop_duplicates(subset=['id'])
#check for NA and unique vals

In [18]:
all_names.shape

(3762, 3)

In [19]:
print(len(all_names['id'].unique()))

3762

In [20]:
all_names.dtypes

id             int64
first_name    object
last_name     object
dtype: object

In [21]:
# no null vals - good
all_names['id'].isnull().sum()

0

In [22]:
all_names.tail()

          id first_name  last_name
3778  573166     Murphy      Smith
3792  643364       Chad    Hinshaw
3793  660168    Roberto  Baldoquin
3794  595887       Jeff      Boehm
3795  622017     Yasiel  Balaguert

In [23]:
all_names.to_csv('./all_names.csv', index=False)

In [24]:
testdf = pd.read_csv('./all_names.csv')

In [25]:
testdf.head()

       id first_name last_name
0  592091       A.J.    Achter
1  595918       A.J.      Cole
2  454560       A.J.     Ellis
3  456167       A.J.   Griffin
4  543362       A.J.   Jimenez